In [8]:
import pandas as pd
import numpy as np
import random
import calendar

In [19]:
world_data = pd.read_csv("world_data_p1.csv", index_col=0)

In [15]:
print(world_data.head())

       Country Density\n(P/Km2) Abbreviation Agricultural Land( %)  \
0  Afghanistan               60           AF                58.10%
1      Albania              105           AL                43.10%
2      Algeria               18           DZ                17.40%
3      Andorra              164           AD                40.00%
4       Angola               26           AO                47.50%

  Land Area(Km2) Armed Forces size  Birth Rate  Calling Code  \
0        652,230           323,000       32.49          93.0
1         28,748             9,000       11.78         355.0
2      2,381,741           317,000       24.28         213.0
3            468               NaN        7.20         376.0
4      1,246,700           117,000       40.73         244.0

  Capital/Major City Co2-Emissions     CPI CPI Change (%) Currency-Code  \
0              Kabul         8,672   149.9          2.30%           AFN
1             Tirana         4,536  119.05          1.40%           ALL
2            Algiers       150,006  151.36          2.00%           DZD
3   Andorra la Vella           469     NaN            NaN           EUR
4             Luanda        34,693  261.73         17.10%           AOA

   Fertility Rate Forested Area (%) Gasoline Price
0            4.47             2.10%         $0.70
1            1.62            28.10%         $1.36
2            3.02             0.80%         $0.28
3            1.27            34.00%         $1.51
4            5.52            46.30%         $0.97

In [16]:
medallas = pd.read_csv("medallas.csv", sep=';')

In [17]:
print(world_data.head())

       Country Density\n(P/Km2) Abbreviation Agricultural Land( %)  \
0  Afghanistan               60           AF                58.10%
1      Albania              105           AL                43.10%
2      Algeria               18           DZ                17.40%
3      Andorra              164           AD                40.00%
4       Angola               26           AO                47.50%

  Land Area(Km2) Armed Forces size  Birth Rate  Calling Code  \
0        652,230           323,000       32.49          93.0
1         28,748             9,000       11.78         355.0
2      2,381,741           317,000       24.28         213.0
3            468               NaN        7.20         376.0
4      1,246,700           117,000       40.73         244.0

  Capital/Major City Co2-Emissions     CPI CPI Change (%) Currency-Code  \
0              Kabul         8,672   149.9          2.30%           AFN
1             Tirana         4,536  119.05          1.40%           ALL
2            Algiers       150,006  151.36          2.00%           DZD
3   Andorra la Vella           469     NaN            NaN           EUR
4             Luanda        34,693  261.73         17.10%           AOA

   Fertility Rate Forested Area (%) Gasoline Price
0            4.47             2.10%         $0.70
1            1.62            28.10%         $1.36
2            3.02             0.80%         $0.28
3            1.27            34.00%         $1.51
4            5.52            46.30%         $0.97

¿Qué diferencia hay entre una Serie y un DataFrame?

La serie es unidensional y un DataFrame es bimesional

Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [18]:
a = np.random.randint(0,100, size= (4,3))

In [19]:
a

array([[ 0, 66, 66],
       [63, 12, 32],
       [28, 86,  8],
       [47, 53, 91]], dtype=int32)

In [21]:
df = pd.DataFrame(a, columns=["España", "Francia", "Italia"])

In [ ]:
df

   España  Francia  Italia
0       0       66      66
1      63       12      32
2      28       86       8
3      47       53      91

In [30]:
medallas = pd.read_csv("medallas.csv", index_col=0)

In [35]:
medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [32]:
medallas.size

40

In [33]:
medallas.shape

(10, 4)

In [34]:
medallas.values

array([['China', 1473, 994, 720],
       ['Japón', 1032, 1037, 985],
       ['Corea del Sur', 745, 663, 827],
       ['Irán', 179, 181, 197],
       ['Kazajistán', 155, 158, 224],
       ['India', 154, 202, 315],
       ['Tailandia', 132, 175, 278],
       ['Indonesia', 112, 131, 240],
       ['China Taipéi', 99, 144, 276],
       ['Corea del Norte', 91, 120, 235]], dtype=object)

In [39]:
medallas.loc[7, "País"]

'Tailandia'

In [40]:
medallas.loc[7]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [46]:
medallas.loc[[1,4]]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

In [ ]:
medallas.loc[[1,4], ["Oro","Plata","Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [54]:
medallas.loc[[1,4], "Oro":"Bronce"]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [65]:
medallas[medallas["País"]=="India"]

    País  Oro  Plata  Bronce
6  India  154    202     315

In [69]:
medallas.iloc[5]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

In [68]:
print(medallas.iloc[5,1])

154

In [72]:
medallas.iloc[1::2]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

In [75]:
medallas.iloc[1::2,1:]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [82]:
medallas.loc[medallas["Oro"]> 200] #Como sacamos solo pais??

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [79]:
medallas.loc[(medallas["Oro"]> 200) & (medallas["Plata"]> 1000)]

    País   Oro  Plata  Bronce
2  Japón  1032   1037     985

In [83]:
medallas.loc[(medallas["Oro"]> 200) & (medallas["Bronce"]> 700)]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [ ]:
valores = [random.randint(1, 100) for i in range(7)]
print(valores)

[2, 19, 88, 61, 71, 24, 72]

In [9]:

indices = list(calendar.day_name)
print(indices)

['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']

In [10]:
pd.Series(valores, index = indices)

Monday        2
Tuesday      19
Wednesday    88
Thursday     61
Friday       71
Saturday     24
Sunday       72
dtype: int64

In [30]:
diccionario = dict(zip(indices, valores))
print(diccionario)

{'Monday': 2, 'Tuesday': 19, 'Wednesday': 88, 'Thursday': 61, 'Friday': 71, 'Saturday': 24, 'Sunday': 72}

In [17]:
x = zip(valores, indices)
print(list(x))

[(2, 'Monday'), (19, 'Tuesday'), (88, 'Wednesday'), (61, 'Thursday'), (71, 'Friday'), (24, 'Saturday'), (72, 'Sunday')]

In [18]:
print(x)

<zip object at 0x000002AC54C27940>

In [ ]:
for tupla in zip(valores, indices):
    print(tupla)
#crear un dic vacío y meter las tuplas

(2, 'Monday')
(19, 'Tuesday')
(88, 'Wednesday')
(61, 'Thursday')
(71, 'Friday')
(24, 'Saturday')
(72, 'Sunday')

In [16]:
dic = list(x)
print(dic)

[]

In [ ]:
diccionario = dict(dic)

más ejercicios de loc e iloc

In [20]:
world_data.head()

,Country,Density\r\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
1,Albania,105,AL,43.10%,"28,748","9,000",11.78,355.0,Tirana,"4,536",119.05,1.40%,ALL,1.62,28.10%,$1.36
2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
3,Andorra,164,AD,40.00%,468,NaN,7.20,376.0,Andorra la Vella,469,NaN,NaN,EUR,1.27,34.00%,$1.51
4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97

In [23]:
world_data.loc[2:4]

,Country,Density\r\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
3,Andorra,164,AD,40.00%,468,NaN,7.20,376.0,Andorra la Vella,469,NaN,NaN,EUR,1.27,34.00%,$1.51
4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97

In [27]:
world_data.loc[world_data['Birth Rate']> 30].head()

,Country,Density\r\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97
18,Benin,108,BJ,33.30%,"112,622","12,000",36.22,229.0,Porto-Novo,"6,476",110.71,-0.90%,XOF,4.84,37.80%,$0.72
26,Burkina Faso,76,BF,44.20%,"274,200","11,000",37.93,226.0,Ouagadougou,"3,418",106.58,-3.20%,XOF,5.19,19.30%,$0.98
27,Burundi,463,BI,79.20%,"27,830","31,000",39.01,257.0,Bujumbura,495,182.11,-0.70%,BIF,5.41,10.90%,$1.21